#+title: Process_data
This notebook shows how to combine all metadata sources into one and generate an sqlite3 database with it. Data should not require manual rearrangements.


** Combine big dataframes (containing JUMP and general ids ).

#+begin_src fish
set fields_csv "JCP2022,standard_key,broad_sample,pert_type,control_type"
set fields (string split , -- $fields_csv)
function clean
   cat - |  tail -n +2  |
   # awk -F"," 'NF < 5{printf $0; for(i = NF; i < 5; ++i)  printf ","; printf "\n" }'
   awk 'BEGIN{FS=OFS=","} {NF=6; print}'
end
echo perturbation,"$fields_csv"  > merged.csv
for i in "compound" "crispr";
csvcut -c (string join ',' $fields[1..2] ) "$i".csv |  sed "s/^/$i,/" | clean >> merged.csv;
end

csvcut -c (string join , $fields[1..4]) orf.csv  | sed 's/^/orf,/' | clean >> merged.csv

head -n 1 merged.csv > merged_small.csv

for i in Target*;
    echo $i;
    set perturbation (basename $i .csv);
    # echo "Analysing $i"
    csvcut -c (string join , $fields[2..5]) $i  | sed "s/^/$perturbation,,/" | clean >> merged_small.csv;
end
#+end_src

#+RESULTS:
| Target1_compound.csv |
| Target1_crispr.csv   |
| Target1_orf.csv      |
| Target2_compound.csv |

** Save it all as an sql dataset
Use the pandas to save it as a sqlite3 database
#+BEGIN_SRC jupyter-python :session test

import sqlite3
import pandas as pd

csv_file = "output.csv"
conn = sqlite3.connect("./names.db")
c = conn.cursor()
df = pd.read_csv(csv_file)
df.to_sql("names", conn, if_exists="replace", index=False)
#+END_SRC

#+RESULTS:
: 140355



Finally you can upload it to Zenodo and update the pooch retrieval url and hash on [[file:../src/broad_babel/query.py]]
